from solution import parser_launch, URL


tests = [{
    'request': [URL, 'А', "Б"],
    'answer': {
        'А': 1225, 'Б': 1686
    }},
    {
    'request': [URL, 'Э', "Я"],
    'answer': {
        'Э': 223, 'Ю': 138, 'Я': 211
    }},
    {
    'request': [URL, 'Й', 'К'],
    'answer': {
        'Й': 4, 'К': 2021
    }},
    {
    'request': [URL, 'И', 'И'],
    'answer': {
        'И': 354
    }},
    {
    'request': [URL, 'Щ', "D"],
    'answer': {
        'Щ': 159, 'Э': 223, 'Ю': 138, 'Я': 211, 'A': 3228, 'B': 837
    }},
    {
    'request': [URL, "А", "Я"],
    'answer': {
        'А': 1226, 'Б': 1686, 'В': 533, 'К': 2320, 'Г': 1016,
        'П': 1801, 'Д': 784, 'Е': 103, 'Ё': 2, 'О': 811, 'Ж': 412,
        'Я': 213, 'З': 645, 'И': 354, 'Й': 4, 'С': 1826, 'Л': 712,
        'М': 1305, 'Н': 471, 'Р': 588, 'Т': 1012, 'У': 272, 'Ф': 197,
        'Х': 288, 'Ц': 228, 'Ч': 692, 'Ш': 286, 'Щ': 159, 'Э': 223, 'Ю': 138
    }},
    {
    'request': [URL, "L", "S"],
    'answer': {
        'L': 1047, 'M': 1744, 'N': 838, 'O': 868, 'P': 2702, 'Q': 45, 'R': 504, 'S': 653
    }},
    {
    'request': [URL, None, None],
    'answer': {
        'А': 1226, 'Б': 1687, 'В': 533, 'К': 2320, 'Г': 1016, 'П': 1801, 'Д': 784, 'Е': 103, 'Ё': 2,
        'О': 811, 'Ж': 412, 'Я': 213, 'З': 645, 'И': 354, 'Й': 4, 'С': 1826, 'Л': 712, 'М': 1307,
        'Н': 471, 'Р': 588, 'Т': 1012, 'У': 272, 'Ф': 197, 'Х': 288, 'Ц': 228, 'Ч': 692, 'Ш': 286,
        'Щ': 159, 'Э': 223, 'Ю': 138, 'A': 3228, 'B': 1011, 'C': 2522, 'D': 1081, 'E': 1038, 'F': 209,
        'G': 691, 'H': 1091, 'I': 356, 'J': 86, 'K': 234, 'L': 1047, 'M': 1744, 'N': 838, 'O': 868,
        'P': 2702, 'Q': 45, 'R': 504, 'S': 1828, 'T': 1382, 'U': 142, 'V': 181, 'W': 94, 'X': 177,
        'Y': 46, 'Z': 213
    }},
]


if __name__ == '__main__':
    for i, test in enumerate(tests):
        arg = test['request']
        test_answer = parser_launch(arg[0], arg[1], arg[2])
        assert test_answer == test['answer'], \
            f'Error on test case {i+1}, got {test_answer}, expected {test["answer"]}'
        print(f"Test {i+1} is OK")